Repository: cavebatsofware/SimRate_Sharp
Catalog: SimRateSharp/Resources/Strings.*.resx
Languages: es, fr

# Panel_SimRate
source: ⚡ SIM RATE
es: ⚡ TASA DE SIMULACIÓN
fr: ⚡ TAUX DE SIMULATION

# Panel_Glide
source: 📐 GLIDE
es: 📐 GLIDE SLOPE
fr: 📐 GLIDE SLOPE

# Panel_Wind
source: 💨 WIND
es: 💨 VIENTO
fr: 💨 VENT

# Panel_Torque
source: ⚙️ TORQUE
es: ⚙️ PAR MOTOR
fr: ⚙️ COUPLE

# Joystick_PressAnyButton
source: Press any joystick button...
es: Presiona cualquier botón del joystick...
fr: Appuyez sur n'importe quel bouton du joystick...

# Joystick_ButtonCaptured
source: ✓ Button {0} captured!
es: ✓ ¡Botón {0} capturado!
fr: ✓ Bouton {0} capturé !

# Menu_Display
source: Display
es: Visualización
fr: Affichage

# Menu_Display_SimRate
source: Sim Rate
es: Tasa de Simulación
fr: Taux de simulation

# Menu_Display_Wind
source: Wind
es: Viento
fr: Vent

# Menu_Opacity
source: Opacity
es: Opacidad
fr: Opacité

# Menu_PollingRate
source: Polling Rate
es: Tasa de Actualización
fr: Taux de rafraîchissement

# Menu_PollingRate_250ms
source: 250ms (may impact performance)
es: 250ms (puede afectar el rendimiento)
fr: 250ms (peut affecter les performances)

# Menu_PollingRate_500ms
source: 500ms (fast)
es: 500ms (rápido)
fr: 500ms (rapide)

# Menu_PollingRate_2000ms
source: 2000ms (slow)
es: 2000ms (lento)
fr: 2000ms (lent)

# Menu_JoystickDevice
source: Joystick Device
es: Dispositivo de Joystick
fr: Périphérique joystick

# Menu_Joystick_NoDevices
source: No devices found
es: No se encontraron dispositivos
fr: Aucun périphérique trouvé

# Menu_Joystick_SelectDeviceFirst
source: Select Joystick Device First
es: Selecciona primero un dispositivo de joystick
fr: Sélectionnez d'abord un périphérique joystick

# Menu_Joystick_SetButton
source: Set Joystick Button (click to configure)
es: Configurar botón del joystick (haz clic para configurar)
fr: Définir le bouton du joystick (cliquez pour configurer)

# Menu_Joystick_ButtonConfigured
source: Joystick Button: {0} (click to change)
es: Botón de Joystick: {0} (haz clic para cambiar)
fr: Bouton du joystick : {0} (cliquez pour modifier)

# Menu_Joystick_ChangeButton
source: Change Button
es: Cambiar Botón
fr: Modifier le bouton

# Menu_Joystick_ClearButton
source: Clear Button
es: Borrar Botón
fr: Effacer le bouton

# Menu_TorqueLimiter
source: Torque Limiter
es: Limitador de Par
fr: Limiteur de couple

# Menu_TorqueLimiter_Enable
source: Enable Torque Limiter
es: Activar Limitador de Par
fr: Activer le limiteur de couple

# Menu_TorqueLimiter_ShowDisplay
source: Show Torque Display
es: Mostrar Indicador de Par
fr: Afficher l'indicateur de couple

# Menu_TorqueLimiter_MaxTorque
source: Max Torque: {0}% (click to adjust)
es: Par Máximo: {0}% (haz clic para ajustar)
fr: Couple max. : {0}% (cliquez pour ajuster)

# Menu_TorqueLimiter_WarningThreshold
source: Warning Threshold: {0}% (click to adjust)
es: Umbral de Advertencia: {0}% (haz clic para ajustar)
fr: Seuil d'avertissement : {0}% (cliquez pour ajuster)

# Menu_TorqueLimiter_ReductionAggression
source: Reduction Aggression: {0:F2} (click to adjust)
es: Agresividad de Reducción: {0:F2} (haz clic para ajustar)
fr: Agressivité de réduction : {0:F2} (cliquez pour ajuster)

# Menu_TorqueLimiter_MinThrottle
source: Minimum Throttle: {0}% (click to adjust)
es: Acelerador Mínimo: {0}% (haz clic para ajustar)
fr: Gaz minimum : {0}% (cliquez pour ajuster)

# Menu_TorqueLimiter_Cooldown
source: Intervention Cooldown: {0}ms (click to adjust)
es: Tiempo de Espera de Intervención: {0}ms (haz clic para ajustar)
fr: Délai entre interventions : {0}ms (cliquez pour ajuster)

# Menu_TorqueLimiter_Interventions
source: Interventions: {0}
es: Intervenciones: {0}

# Menu_Units
source: Units
es: Unidades
fr: Unités

# Menu_Units_SpeedUnit
source: Speed Unit
es: Unidad de velocidad
fr: Unité de vitesse

# Menu_Units_AltitudeUnit
source: Altitude Unit
es: Unidad de altitud
fr: Unité d'altitude

# Menu_Units_Speed_Knots
source: Knots (kts) - ICAO Standard
es: Nudos (kts) - Estándar OACI
fr: Nœuds (kts) - Standard OACI

# Menu_Units_Speed_KMH
source: Kilometers per Hour (km/h)
es: Kilómetros por hora (km/h)
fr: Kilomètres par heure (km/h)

# Menu_Units_Speed_MPH
source: Miles per Hour (mph)
es: Millas por hora (mph)
fr: Miles par heure (mph)

# Menu_Units_Altitude_Feet
source: Feet (ft) - ICAO Standard
es: Pies (ft) - Estándar OACI
fr: Pieds (ft) - Standard OACI

# Menu_Units_Altitude_Meters
source: Meters (m)
es: Metros (m)
fr: Mètres (m)

# Menu_Language
source: Language
es: Idioma
fr: Langue

# Menu_Language_German
source: Deutsch (German)
es: Deutsch
fr: Deutsch

# Menu_Language_French
source: Français (French)
es: Français
fr: Français

# Menu_Language_Chinese
source: 中文 (Chinese)
es: 中文
fr: 中文

# Menu_Language_Spanish
source: Español (Spanish)
es: Español
fr: Español

# Menu_Language_RestartRequired
source: Language will change to {0} after restart. Restart now?
es: El idioma cambiará a {0} después de reiniciar. ¿Reiniciar ahora?
fr: La langue passera en {0} après le redémarrage. Redémarrer maintenant ?

# Menu_Language_RestartTitle
source: Restart Required
es: Reinicio Requerido
fr: Redémarrage requis

# Menu_About
source: About
es: Acerca de
fr: À propos

# Menu_Exit
source: Exit
es: Salir
fr: Quitter

# About_Subtitle
source: Sim Rate Monitor and Control for MSFS
es: Monitor y Control de Tasa de Simulación para MSFS
fr: Moniteur et contrôle du taux de simulation pour MSFS

# About_Description
source: An overlay for monitoring and resetting simulation rate in Microsoft Flight Simulator 2024
es: Una superposición para monitorear y restablecer la tasa de simulación en Microsoft Flight Simulator 2024
fr: Une superposition pour surveiller et réinitialiser le taux de simulation dans Microsoft Flight Simulator 2024

# About_ViewOnGitHub
source: View on GitHub
es: Ver en GitHub
fr: Voir sur GitHub

# About_Close
source: Close
es: Cerrar
fr: Fermer

# Dialog_MaxTorque_Title
source: Configure Max Torque %
es: Configurar Par Máximo %
fr: Configurer le couple max. (%)

# Dialog_MaxTorque_Prompt
source: Enter maximum torque limit as percentage of aircraft's rated max: Current: {0}% Common values: • 100% = Rated maximum (redline) • 95% = Conservative limit • 90% = Safe continuous operation • 105% = Allow brief excursions above redline
es: Ingresa el límite de par máximo como porcentaje del máximo nominal: Actual: {0}% Valores comunes: • 100% = Máximo nominal (línea roja) • 95% = Límite conservador • 90% = Operación continua segura • 105% = Permitir breves excursiones sobre la línea roja
fr: Entrez la limite de couple maximale en pourcentage du maximum nominal : Actuel : {0}% Valeurs courantes : • 100% = Maximum nominal (ligne rouge) • 95% = Limite prudente • 90% = Fonctionnement continu sûr • 105% = Autoriser de brèves excursions au-delà de la ligne rouge

# Dialog_WarningThreshold_Title
source: Warning Threshold %
es: Umbral de Advertencia %
fr: Seuil d'avertissement (%)

# Dialog_WarningThreshold_Prompt
source: Enter warning threshold (yellow color) as percentage: Current: {0}% This is when bars turn yellow before hitting the red limit. Typical: 90-95%
es: Ingresa el umbral de advertencia (color amarillo) como porcentaje: Actual: {0}% Momento en que las barras se vuelven amarillas antes de alcanzar el límite rojo. Típico: 90-95%
fr: Entrez le seuil d'avertissement (couleur jaune) en pourcentage : Actuel : {0}% C'est le moment où les barres deviennent jaunes avant d'atteindre la limite rouge. Typique : 90-95%

# Dialog_ReductionAggression_Title
source: Reduction Aggression
es: Agresividad de Reducción
fr: Agressivité de réduction

# Dialog_ReductionAggression_Prompt
source: Enter throttle reduction aggression multiplier: Current: {0:F2} How this works: • 8% overtorque × 2.5x = 20% throttle reduction • Higher = more aggressive cuts • Lower = gentler reductions Typical range: 1.5 - 4.0
es: Ingresa el multiplicador de agresividad de reducción del acelerador: Actual: {0:F2} Cómo funciona: • 8% de exceso de par × 2,5x = 20% de reducción del acelerador • Mayor = reducciones más agresivas • Menor = reducciones más suaves Rango típico: 1,5 - 4,0
fr: Entrez le multiplicateur d'agressivité de réduction des gaz : Actuel : {0:F2} Fonctionnement : • 8% de surcouple × 2,5x = 20% de réduction des gaz • Plus élevé = réductions plus agressives • Plus bas = réductions plus douces Plage typique : 1,5 - 4,0

# Dialog_MinThrottle_Title
source: Minimum Throttle %
es: Acelerador Mínimo %
fr: Gaz minimum (%)

# Dialog_MinThrottle_Prompt
source: Enter minimum throttle floor (safety limit): Current: {0}% The system will never reduce throttle below this value to prevent stalling. Typical: 30-50%
es: Ingresa el límite mínimo del acelerador (límite de seguridad): Actual: {0}% El sistema nunca reducirá el acelerador por debajo de este valor para evitar pérdida de sustentación. Típico: 30-50%
fr: Entrez le plancher minimum des gaz (limite de sécurité) : Actuel : {0}% Le système ne réduira jamais les gaz en dessous de cette valeur pour éviter le décrochage. Typique : 30-50%

# Dialog_Cooldown_Title
source: Intervention Cooldown (ms)
es: Tiempo de Espera de Intervención (ms)
fr: Délai entre interventions (ms)

# Dialog_Cooldown_Prompt
source: Enter time between throttle interventions (milliseconds): Current: {0}ms This allows engine/prop to stabilize between corrections. Recommended: • 1000ms (1 sec) = fast response • 2000ms (2 sec) = balanced • 3000ms (3 sec) = conservative
es: Ingresa el tiempo entre intervenciones del acelerador (milisegundos): Actual: {0}ms Permite que el motor/hélice se estabilice entre correcciones. Recomendado: • 1000ms (1 seg) = respuesta rápida • 2000ms (2 seg) = equilibrado • 3000ms (3 seg) = conservador
fr: Entrez le temps entre les interventions sur les gaz (millisecondes) : Actuel : {0}ms Cela permet au moteur/hélice de se stabiliser entre les corrections. Recommandé : • 1000ms (1 sec) = réponse rapide • 2000ms (2 sec) = équilibré • 3000ms (3 sec) = conservateur

# Error_FatalError
source: Fatal error: {0}
es: Error fatal: {0}
fr: Erreur fatale : {0}

# Error_ApplicationError
source: Application Error
es: Error de Aplicación
fr: Erreur d'application

# Error_UnhandledException
source: Unhandled exception: {0} {1}
es: Excepción no controlada: {0} {1}
fr: Exception non gérée : {0} {1}

# Error_JoystickDevice
source: Joystick device error: {0} The application cannot read from the configured joystick device.
es: Error de dispositivo de joystick: {0} La aplicación no puede leer desde el dispositivo de joystick configurado.
fr: Erreur de périphérique joystick : {0} L'application ne peut pas lire depuis le périphérique joystick configuré.

# Error_JoystickTitle
source: Joystick Error
es: Error de Joystick
fr: Erreur de joystick

# Error_BrowserOpen
source: Could not open browser: {0}
es: No se pudo abrir el navegador: {0}
fr: Impossible d'ouvrir le navigateur : {0}

# Error_Title
source: Error
fr: Erreur
